Revit 2027 API
NumberingFormatSettings.AsCharacters Property
 True if the number is using characters, false for digits.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AsCharacters { get; set; }
Public Property AsCharacters As Boolean
	Get
	Set
public:
property bool AsCharacters {
	bool get ();
	void set (bool value);
}
member AsCharacters : bool with get, set
Property Value
Boolean
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace